let url = 'http://127.0.0.1:8080';

let books = [
    {
        author: 'М.Фаулер',
        name: 'Asyncio и конкурентное программирование на Python',
        comments: 'С другой стороны новая модель организационной деятельности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Таким образом реализация намеченных плановых заданий в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Таким образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач.Равным образом новая модель организационной деятельности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности способствует подготовки и реализации направлений прогрессивного развития. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности способствует подготовки и реализации дальнейших направлений развития. Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке форм развития.Равным образом начало повседневной работы по формированию позиции требуют определения и уточнения соответствующий условий активизации. С другой стороны сложившаяся структура организации позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач.Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции в значительной степени обуславливает создание соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции позволяет оценить значение соответствующий условий активизации. ',
        img: './img/book.avif'
    },
    {
        author: 'М.Фаулер',
        name: 'Asyncio и асинхронной программирование на Python',
        comments: 'С другой стороны новая модель организационной деятельности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Таким образом реализация намеченных плановых заданий в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Таким образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач.Равным образом новая модель организационной деятельности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности способствует подготовки и реализации направлений прогрессивного развития. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности способствует подготовки и реализации дальнейших направлений развития. Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке форм развития.Равным образом начало повседневной работы по формированию позиции требуют определения и уточнения соответствующий условий активизации. С другой стороны сложившаяся структура организации позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач.Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции в значительной степени обуславливает создание соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции позволяет оценить значение соответствующий условий активизации. ',
        img: './img/book.avif'
    },
    {
        author: 'М.Фаулер',
        name: 'Asyncio и асинхронной программирование на Python',
        comments: 'С другой стороны новая модель организационной деятельности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Задача организации, в особенности же постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений развития. Таким образом реализация намеченных плановых заданий в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Таким образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. С другой стороны рамки и место обучения кадров влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач.Равным образом новая модель организационной деятельности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности способствует подготовки и реализации направлений прогрессивного развития. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности способствует подготовки и реализации дальнейших направлений развития. Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке форм развития.Равным образом начало повседневной работы по формированию позиции требуют определения и уточнения соответствующий условий активизации. С другой стороны сложившаяся структура организации позволяет оценить значение позиций, занимаемых участниками в отношении поставленных задач.Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции в значительной степени обуславливает создание соответствующий условий активизации. Товарищи! начало повседневной работы по формированию позиции позволяет оценить значение соответствующий условий активизации.',
        img: './img/book.avif'
    }
];

const books_div = document.querySelector('.content');

for (let i=0; i< books.length;i++) {
    let book_box = document.createElement('div');
    book_box.classList.add('book_box');
    
    let pic_box = document.createElement('div');
    pic_box.classList.add('book_pic');
    let img = document.createElement('img');
    img.classList.add('book_img')
    img.src = books[i].img;
    pic_box.appendChild(img);
    
    let text_box = document.createElement('div');
    text_box.classList.add('book_text');
    
    text_box.innerHTML = '<h3>' + books[i].name + ' - ' + books[i].author + '</h3>';
    text_box.innerHTML += books[i].comments

    let text_height = text_box.offsetHeight

    book_box.appendChild(pic_box);
    book_box.appendChild(text_box);

    books_div.appendChild(book_box);
};


